tests/Feature/Import/i2g_invoices.csv

Id,AccountId,State,LastUpdated,CreatedDate,DocumentDate,DocumentNumber,Comment,Name,EmailRecipient,DocumentStatus,OutputStatus,PartPayment,DocumentRecipientAddress,ShipDate,ShipAddress,ShipAmount,ShipTrackingNumber,ShipVia,ShipFob,StyleName,DatePaid,CustomField,DiscountType,Discount,DiscountValue,Taxes,WithholdingTaxName,WithholdingTaxRate,TermsOld,Payments,Items,CurrencyCode,TotalAmount,BalanceDueAmount,AmountPaidAmount,DiscountAmount,SubtotalAmount,TotalTaxAmount,WithholdingTaxAmount
a693ce35-78ed-49d8-a1be-968b4b18d689,24379237,synced,2021-01-28T11:04:09+00:00,2021-01-28T07:57:37+00:00,2021-01-28,1,,Barry Gordon,barry@capitalcity.gov,unsent,unsent,false,,,,0,,,,invoice,,,no_discount,0,0,"name,auto_apply,inclusive,id,rates,accumulative_of;Ma'am,true,false,d4037c01-b719-4e89-a1f4-91c0daf3ee34,""is_default,value;true,17"",",Withholding Tax,0,0,,"code,description,qty,unit_type,withholding_tax_applies,applied_taxes,unit_price,discount_percentage,discount_type,discount_amount;,Bumper paint touch up,4,parts,false,""rate,tax_id;17,d4037c01-b719-4e89-a1f4-91c0daf3ee34"",35,0,no_discount,0;,Wood Hammer Mallets,10,parts,false,""rate,tax_id;17,d4037c01-b719-4e89-a1f4-91c0daf3ee34"",2.5,0,no_discount,0;,Monthly Lawn Service 2 Hours Weekly,4,parts,false,""rate,tax_id;17,d4037c01-b719-4e89-a1f4-91c0daf3ee34"",65,0,no_discount,0;,Internal Hardware Repair,6,parts,false,""rate,tax_id;17,d4037c01-b719-4e89-a1f4-91c0daf3ee34"",65,0,no_discount,0",ILS,953.55,953.55,0,0,815,"sub_total,total,rate,tax_id;815,138.55,17,d4037c01-b719-4e89-a1f4-91c0daf3ee34",0
a8acb5bc-c855-42b7-b56e-6fab01d14899,24379237,synced,2021-01-28T11:07:43+00:00,2021-01-28T11:07:05+00:00,2021-01-28,2,,James Gordon,commissionon@gotham.gov,unsent,unsent,false,,,,0,,,,invoice,,,no_discount,0,0,"name,auto_apply,inclusive,id,rates,accumulative_of;TAX,true,false,115e965e-eed8-4ea1-b1ca-cd1b36b8798a,""is_default,value;true,8"",",Withholding Tax,0,0,,"code,description,qty,unit_type,withholding_tax_applies,applied_taxes,unit_price,discount_percentage,discount_type,discount_amount;,Internal Hardware Repair,1,parts,false,""rate,tax_id;8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a"",65,0,no_discount,0",USD,70.2,70.2,0,0,65,"sub_total,total,rate,tax_id;65,5.2,8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a",0
55152bdc-76b3-46eb-9420-cca8c9e7a081,24379237,synced,2021-01-28T11:08:08+00:00,2021-01-28T11:07:52+00:00,2021-01-28,4,,Deadpool Inc,wade@projectx.net,unsent,unsent,false,2584 Sesame Street,,2584 Sesame Street,0,,,,invoice,,,no_discount,0,0,"name,auto_apply,inclusive,id,rates,accumulative_of;TAX,true,false,115e965e-eed8-4ea1-b1ca-cd1b36b8798a,""is_default,value;true,8"",",Withholding Tax,0,30,,"code,description,qty,unit_type,withholding_tax_applies,applied_taxes,unit_price,discount_percentage,discount_type,discount_amount;,Internal Hardware Repair,1,parts,false,""rate,tax_id;8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a"",65,0,no_discount,0;,Monthly Lawn Service 2 Hours Weekly,1,parts,false,""rate,tax_id;8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a"",0,0,no_discount,0;,Wood Hammer Mallets,1,parts,false,""rate,tax_id;8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a"",2.5,0,no_discount,0",USD,72.9,72.9,0,0,67.5,"sub_total,total,rate,tax_id;67.5,5.4,8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a",0
73c9c7be-abea-4154-92eb-ebf674b13748,24379237,synced,2021-01-28T11:08:51+00:00,2021-01-28T11:07:21+00:00,2021-01-28,3,,Daily Planet,louislane@dailyplanet.com,unsent,unsent,false,"2587 Super Plaza, Floor 25, Metropolis",,"2587 Super Plaza, Floor 25, Metropolis",0,,,,invoice,,,no_discount,0,0,"name,auto_apply,inclusive,id,rates,accumulative_of;TAX,true,false,115e965e-eed8-4ea1-b1ca-cd1b36b8798a,""is_default,value;true,8"",",Withholding Tax,0,14,,"code,description,qty,unit_type,withholding_tax_applies,applied_taxes,unit_price,discount_percentage,discount_type,discount_amount;,Monthly Lawn Service 2 Hours Weekly,4,labor_hours,false,""rate,tax_id;8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a"",85,0,no_discount,0",USD,367.2,367.2,0,0,340,"sub_total,total,rate,tax_id;340,27.2,8,115e965e-eed8-4ea1-b1ca-cd1b36b8798a",0
